توضیحات مورد نیاز در مورد CodeFirst

1- نصب پکیج های مورد نیاز برای Entity Framework
2- ایجاد کلاسی برای ارتباط بین دیتابیس و برنامه (databasecontext)
3- ایجاد Add-Migration
4- Update-Database

در این بین نیاز هست تا یکسری موارد توسط برنامه نویس رعایت شود

برای حذف یک مایگریشن از دستور زیر استفاده میکنیم
remove-migration نام مایگریشن

برای بدست آوردن اسکریپت تغییرات از دستور زیر استفاده میکنیم
script-migration نام مایگریشنی که اسکریپت بعد از اونو نیاز داریم
Script-migration نام مایگریشنی که اسکریپت قبل از اونو نیاز داریم   نام مایگریشنی که اسکریپت بعد از اونو نیاز داریم 

اگر در برنامه به دیتابیس های مختلفی متصل باشیم دستورات تغییراتی نیاز دارند
در این دستورات باید context را به صورت صریح مشخص کنیم
Add-Migration -context نام کانتکس را وارد میکنیم

اگر نیاز بود دستورات مایگریشن ایجاد شده را تغییر دهیم میتوانیم از فایل ایجاد شده توسط خود ef استفاده کنیم